Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSent_reg.h
/** \brief  49C, Receive Data View Register */
#define SENT_CH14_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000349Cu)

/** Alias (User Manual Name) for SENT_CH14_VIEW.
* To use register names with standard convension, please use SENT_CH14_VIEW.
*/
#define	SENT_VIEW14	(SENT_CH14_VIEW)

/** \brief  4B4, Watch Dog Timer Register */
#define SENT_CH14_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00034B4u)

/** Alias (User Manual Name) for SENT_CH14_WDT.
* To use register names with standard convension, please use SENT_CH14_WDT.
*/
#define	SENT_WDT14	(SENT_CH14_WDT)

/** \brief  4C4, Channel Fractional Divider Register */
#define SENT_CH15_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF00034C4u)

/** Alias (User Manual Name) for SENT_CH15_CFDR.
* To use register names with standard convension, please use SENT_CH15_CFDR.
*/
#define	SENT_CFDR15	(SENT_CH15_CFDR)

/** \brief  4C0, Channel Pre Divider Register */
#define SENT_CH15_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF00034C0u)

/** Alias (User Manual Name) for SENT_CH15_CPDR.
* To use register names with standard convension, please use SENT_CH15_CPDR.
*/
#define	SENT_CPDR15	(SENT_CH15_CPDR)

/** \brief  4F0, Interrupt Node Pointer Register */
#define SENT_CH15_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF00034F0u)

/** Alias (User Manual Name) for SENT_CH15_INP.
* To use register names with standard convension, please use SENT_CH15_INP.
*/
#define	SENT_INP15	(SENT_CH15_INP)

/** \brief  4E8, Interrupt Clear Register */
#define SENT_CH15_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF00034E8u)

/** Alias (User Manual Name) for SENT_CH15_INTCLR.
* To use register names with standard convension, please use SENT_CH15_INTCLR.
*/
#define	SENT_INTCLR15	(SENT_CH15_INTCLR)

/** \brief  4EC, Interrupt Enable Register */
#define SENT_CH15_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF00034ECu)

/** Alias (User Manual Name) for SENT_CH15_INTEN.
* To use register names with standard convension, please use SENT_CH15_INTEN.
*/
#define	SENT_INTEN15	(SENT_CH15_INTEN)

/** \brief  4E4, Interrupt Set Register */
#define SENT_CH15_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF00034E4u)

/** Alias (User Manual Name) for SENT_CH15_INTSET.
* To use register names with standard convension, please use SENT_CH15_INTSET.
*/
#define	SENT_INTSET15	(SENT_CH15_INTSET)

/** \brief  4E0, Interrupt Status Register */
#define SENT_CH15_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF00034E0u)

/** Alias (User Manual Name) for SENT_CH15_INTSTAT.
* To use register names with standard convension, please use SENT_CH15_INTSTAT.
*/
#define	SENT_INTSTAT15	(SENT_CH15_INTSTAT)

/** \brief  4D4, Input and Output Control Register */
#define SENT_CH15_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF00034D4u)

/** Alias (User Manual Name) for SENT_CH15_IOCR.
* To use register names with standard convension, please use SENT_CH15_IOCR.
*/
#define	SENT_IOCR15	(SENT_CH15_IOCR)

/** \brief  4C8, Receiver Control Register */
#define SENT_CH15_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF00034C8u)

/** Alias (User Manual Name) for SENT_CH15_RCR.
* To use register names with standard convension, please use SENT_CH15_RCR.
*/
#define	SENT_RCR15	(SENT_CH15_RCR)

/** \brief  4CC, Receive Status Register */
#define SENT_CH15_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF00034CCu)

/** Alias (User Manual Name) for SENT_CH15_RSR.
* To use register names with standard convension, please use SENT_CH15_RSR.
*/
#define	SENT_RSR15	(SENT_CH15_RSR)

/** \brief  4D8, SPC Control Register */
#define SENT_CH15_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF00034D8u)

/** Alias (User Manual Name) for SENT_CH15_SCR.
* To use register names with standard convension, please use SENT_CH15_SCR.
*/
#define	SENT_SCR15	(SENT_CH15_SCR)

/** \brief  4D0, Serial Data and Status Register */
#define SENT_CH15_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF00034D0u)

/** Alias (User Manual Name) for SENT_CH15_SDS.
* To use register names with standard convension, please use SENT_CH15_SDS.
*/
#define	SENT_SDS15	(SENT_CH15_SDS)

/** \brief  4DC, Receive Data View Register */
#define SENT_CH15_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF00034DCu)

/** Alias (User Manual Name) for SENT_CH15_VIEW.
* To use register names with standard convension, please use SENT_CH15_VIEW.
*/
#define	SENT_VIEW15	(SENT_CH15_VIEW)

/** \brief  4F4, Watch Dog Timer Register */
#define SENT_CH15_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00034F4u)

/** Alias (User Manual Name) for SENT_CH15_WDT.
* To use register names with standard convension, please use SENT_CH15_WDT.
*/
#define	SENT_WDT15	(SENT_CH15_WDT)

/** \brief  504, Channel Fractional Divider Register */
#define SENT_CH16_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003504u)

/** Alias (User Manual Name) for SENT_CH16_CFDR.
* To use register names with standard convension, please use SENT_CH16_CFDR.
*/
#define	SENT_CFDR16	(SENT_CH16_CFDR)

/** \brief  500, Channel Pre Divider Register */
#define SENT_CH16_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003500u)

/** Alias (User Manual Name) for SENT_CH16_CPDR.
* To use register names with standard convension, please use SENT_CH16_CPDR.
*/
#define	SENT_CPDR16	(SENT_CH16_CPDR)

/** \brief  530, Interrupt Node Pointer Register */
#define SENT_CH16_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003530u)

/** Alias (User Manual Name) for SENT_CH16_INP.
* To use register names with standard convension, please use SENT_CH16_INP.
*/
#define	SENT_INP16	(SENT_CH16_INP)

/** \brief  528, Interrupt Clear Register */
#define SENT_CH16_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003528u)

/** Alias (User Manual Name) for SENT_CH16_INTCLR.
* To use register names with standard convension, please use SENT_CH16_INTCLR.
*/
#define	SENT_INTCLR16	(SENT_CH16_INTCLR)

/** \brief  52C, Interrupt Enable Register */
#define SENT_CH16_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000352Cu)

/** Alias (User Manual Name) for SENT_CH16_INTEN.
* To use register names with standard convension, please use SENT_CH16_INTEN.
*/
#define	SENT_INTEN16	(SENT_CH16_INTEN)

/** \brief  524, Interrupt Set Register */
#define SENT_CH16_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003524u)

/** Alias (User Manual Name) for SENT_CH16_INTSET.
* To use register names with standard convension, please use SENT_CH16_INTSET.
*/
#define	SENT_INTSET16	(SENT_CH16_INTSET)

