Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSent_reg.h
/** \brief  520, Interrupt Status Register */
#define SENT_CH16_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003520u)

/** Alias (User Manual Name) for SENT_CH16_INTSTAT.
* To use register names with standard convension, please use SENT_CH16_INTSTAT.
*/
#define	SENT_INTSTAT16	(SENT_CH16_INTSTAT)

/** \brief  514, Input and Output Control Register */
#define SENT_CH16_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003514u)

/** Alias (User Manual Name) for SENT_CH16_IOCR.
* To use register names with standard convension, please use SENT_CH16_IOCR.
*/
#define	SENT_IOCR16	(SENT_CH16_IOCR)

/** \brief  508, Receiver Control Register */
#define SENT_CH16_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003508u)

/** Alias (User Manual Name) for SENT_CH16_RCR.
* To use register names with standard convension, please use SENT_CH16_RCR.
*/
#define	SENT_RCR16	(SENT_CH16_RCR)

/** \brief  50C, Receive Status Register */
#define SENT_CH16_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000350Cu)

/** Alias (User Manual Name) for SENT_CH16_RSR.
* To use register names with standard convension, please use SENT_CH16_RSR.
*/
#define	SENT_RSR16	(SENT_CH16_RSR)

/** \brief  518, SPC Control Register */
#define SENT_CH16_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003518u)

/** Alias (User Manual Name) for SENT_CH16_SCR.
* To use register names with standard convension, please use SENT_CH16_SCR.
*/
#define	SENT_SCR16	(SENT_CH16_SCR)

/** \brief  510, Serial Data and Status Register */
#define SENT_CH16_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003510u)

/** Alias (User Manual Name) for SENT_CH16_SDS.
* To use register names with standard convension, please use SENT_CH16_SDS.
*/
#define	SENT_SDS16	(SENT_CH16_SDS)

/** \brief  51C, Receive Data View Register */
#define SENT_CH16_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000351Cu)

/** Alias (User Manual Name) for SENT_CH16_VIEW.
* To use register names with standard convension, please use SENT_CH16_VIEW.
*/
#define	SENT_VIEW16	(SENT_CH16_VIEW)

/** \brief  534, Watch Dog Timer Register */
#define SENT_CH16_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003534u)

/** Alias (User Manual Name) for SENT_CH16_WDT.
* To use register names with standard convension, please use SENT_CH16_WDT.
*/
#define	SENT_WDT16	(SENT_CH16_WDT)

/** \brief  544, Channel Fractional Divider Register */
#define SENT_CH17_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003544u)

/** Alias (User Manual Name) for SENT_CH17_CFDR.
* To use register names with standard convension, please use SENT_CH17_CFDR.
*/
#define	SENT_CFDR17	(SENT_CH17_CFDR)

/** \brief  540, Channel Pre Divider Register */
#define SENT_CH17_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003540u)

/** Alias (User Manual Name) for SENT_CH17_CPDR.
* To use register names with standard convension, please use SENT_CH17_CPDR.
*/
#define	SENT_CPDR17	(SENT_CH17_CPDR)

/** \brief  570, Interrupt Node Pointer Register */
#define SENT_CH17_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003570u)

/** Alias (User Manual Name) for SENT_CH17_INP.
* To use register names with standard convension, please use SENT_CH17_INP.
*/
#define	SENT_INP17	(SENT_CH17_INP)

/** \brief  568, Interrupt Clear Register */
#define SENT_CH17_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003568u)

/** Alias (User Manual Name) for SENT_CH17_INTCLR.
* To use register names with standard convension, please use SENT_CH17_INTCLR.
*/
#define	SENT_INTCLR17	(SENT_CH17_INTCLR)

/** \brief  56C, Interrupt Enable Register */
#define SENT_CH17_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000356Cu)

/** Alias (User Manual Name) for SENT_CH17_INTEN.
* To use register names with standard convension, please use SENT_CH17_INTEN.
*/
#define	SENT_INTEN17	(SENT_CH17_INTEN)

/** \brief  564, Interrupt Set Register */
#define SENT_CH17_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003564u)

/** Alias (User Manual Name) for SENT_CH17_INTSET.
* To use register names with standard convension, please use SENT_CH17_INTSET.
*/
#define	SENT_INTSET17	(SENT_CH17_INTSET)

/** \brief  560, Interrupt Status Register */
#define SENT_CH17_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003560u)

/** Alias (User Manual Name) for SENT_CH17_INTSTAT.
* To use register names with standard convension, please use SENT_CH17_INTSTAT.
*/
#define	SENT_INTSTAT17	(SENT_CH17_INTSTAT)

/** \brief  554, Input and Output Control Register */
#define SENT_CH17_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003554u)

/** Alias (User Manual Name) for SENT_CH17_IOCR.
* To use register names with standard convension, please use SENT_CH17_IOCR.
*/
#define	SENT_IOCR17	(SENT_CH17_IOCR)

/** \brief  548, Receiver Control Register */
#define SENT_CH17_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003548u)

/** Alias (User Manual Name) for SENT_CH17_RCR.
* To use register names with standard convension, please use SENT_CH17_RCR.
*/
#define	SENT_RCR17	(SENT_CH17_RCR)

/** \brief  54C, Receive Status Register */
#define SENT_CH17_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000354Cu)

/** Alias (User Manual Name) for SENT_CH17_RSR.
* To use register names with standard convension, please use SENT_CH17_RSR.
*/
#define	SENT_RSR17	(SENT_CH17_RSR)

/** \brief  558, SPC Control Register */
#define SENT_CH17_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003558u)

/** Alias (User Manual Name) for SENT_CH17_SCR.
* To use register names with standard convension, please use SENT_CH17_SCR.
*/
#define	SENT_SCR17	(SENT_CH17_SCR)

/** \brief  550, Serial Data and Status Register */
#define SENT_CH17_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003550u)

/** Alias (User Manual Name) for SENT_CH17_SDS.
* To use register names with standard convension, please use SENT_CH17_SDS.
*/
#define	SENT_SDS17	(SENT_CH17_SDS)

/** \brief  55C, Receive Data View Register */
#define SENT_CH17_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000355Cu)

/** Alias (User Manual Name) for SENT_CH17_VIEW.
* To use register names with standard convension, please use SENT_CH17_VIEW.
*/
#define	SENT_VIEW17	(SENT_CH17_VIEW)

/** \brief  574, Watch Dog Timer Register */
#define SENT_CH17_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003574u)

/** Alias (User Manual Name) for SENT_CH17_WDT.
* To use register names with standard convension, please use SENT_CH17_WDT.
*/
#define	SENT_WDT17	(SENT_CH17_WDT)

/** \brief  584, Channel Fractional Divider Register */
#define SENT_CH18_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003584u)

