Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSent_reg.h
/** Alias (User Manual Name) for SENT_CH18_CFDR.
* To use register names with standard convension, please use SENT_CH18_CFDR.
*/
#define	SENT_CFDR18	(SENT_CH18_CFDR)

/** \brief  580, Channel Pre Divider Register */
#define SENT_CH18_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003580u)

/** Alias (User Manual Name) for SENT_CH18_CPDR.
* To use register names with standard convension, please use SENT_CH18_CPDR.
*/
#define	SENT_CPDR18	(SENT_CH18_CPDR)

/** \brief  5B0, Interrupt Node Pointer Register */
#define SENT_CH18_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF00035B0u)

/** Alias (User Manual Name) for SENT_CH18_INP.
* To use register names with standard convension, please use SENT_CH18_INP.
*/
#define	SENT_INP18	(SENT_CH18_INP)

/** \brief  5A8, Interrupt Clear Register */
#define SENT_CH18_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF00035A8u)

/** Alias (User Manual Name) for SENT_CH18_INTCLR.
* To use register names with standard convension, please use SENT_CH18_INTCLR.
*/
#define	SENT_INTCLR18	(SENT_CH18_INTCLR)

/** \brief  5AC, Interrupt Enable Register */
#define SENT_CH18_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF00035ACu)

/** Alias (User Manual Name) for SENT_CH18_INTEN.
* To use register names with standard convension, please use SENT_CH18_INTEN.
*/
#define	SENT_INTEN18	(SENT_CH18_INTEN)

/** \brief  5A4, Interrupt Set Register */
#define SENT_CH18_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF00035A4u)

/** Alias (User Manual Name) for SENT_CH18_INTSET.
* To use register names with standard convension, please use SENT_CH18_INTSET.
*/
#define	SENT_INTSET18	(SENT_CH18_INTSET)

/** \brief  5A0, Interrupt Status Register */
#define SENT_CH18_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF00035A0u)

/** Alias (User Manual Name) for SENT_CH18_INTSTAT.
* To use register names with standard convension, please use SENT_CH18_INTSTAT.
*/
#define	SENT_INTSTAT18	(SENT_CH18_INTSTAT)

/** \brief  594, Input and Output Control Register */
#define SENT_CH18_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003594u)

/** Alias (User Manual Name) for SENT_CH18_IOCR.
* To use register names with standard convension, please use SENT_CH18_IOCR.
*/
#define	SENT_IOCR18	(SENT_CH18_IOCR)

/** \brief  588, Receiver Control Register */
#define SENT_CH18_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003588u)

/** Alias (User Manual Name) for SENT_CH18_RCR.
* To use register names with standard convension, please use SENT_CH18_RCR.
*/
#define	SENT_RCR18	(SENT_CH18_RCR)

/** \brief  58C, Receive Status Register */
#define SENT_CH18_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000358Cu)

/** Alias (User Manual Name) for SENT_CH18_RSR.
* To use register names with standard convension, please use SENT_CH18_RSR.
*/
#define	SENT_RSR18	(SENT_CH18_RSR)

/** \brief  598, SPC Control Register */
#define SENT_CH18_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003598u)

/** Alias (User Manual Name) for SENT_CH18_SCR.
* To use register names with standard convension, please use SENT_CH18_SCR.
*/
#define	SENT_SCR18	(SENT_CH18_SCR)

/** \brief  590, Serial Data and Status Register */
#define SENT_CH18_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003590u)

/** Alias (User Manual Name) for SENT_CH18_SDS.
* To use register names with standard convension, please use SENT_CH18_SDS.
*/
#define	SENT_SDS18	(SENT_CH18_SDS)

/** \brief  59C, Receive Data View Register */
#define SENT_CH18_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000359Cu)

/** Alias (User Manual Name) for SENT_CH18_VIEW.
* To use register names with standard convension, please use SENT_CH18_VIEW.
*/
#define	SENT_VIEW18	(SENT_CH18_VIEW)

/** \brief  5B4, Watch Dog Timer Register */
#define SENT_CH18_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00035B4u)

/** Alias (User Manual Name) for SENT_CH18_WDT.
* To use register names with standard convension, please use SENT_CH18_WDT.
*/
#define	SENT_WDT18	(SENT_CH18_WDT)

/** \brief  5C4, Channel Fractional Divider Register */
#define SENT_CH19_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF00035C4u)

/** Alias (User Manual Name) for SENT_CH19_CFDR.
* To use register names with standard convension, please use SENT_CH19_CFDR.
*/
#define	SENT_CFDR19	(SENT_CH19_CFDR)

/** \brief  5C0, Channel Pre Divider Register */
#define SENT_CH19_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF00035C0u)

/** Alias (User Manual Name) for SENT_CH19_CPDR.
* To use register names with standard convension, please use SENT_CH19_CPDR.
*/
#define	SENT_CPDR19	(SENT_CH19_CPDR)

/** \brief  5F0, Interrupt Node Pointer Register */
#define SENT_CH19_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF00035F0u)

/** Alias (User Manual Name) for SENT_CH19_INP.
* To use register names with standard convension, please use SENT_CH19_INP.
*/
#define	SENT_INP19	(SENT_CH19_INP)

/** \brief  5E8, Interrupt Clear Register */
#define SENT_CH19_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF00035E8u)

/** Alias (User Manual Name) for SENT_CH19_INTCLR.
* To use register names with standard convension, please use SENT_CH19_INTCLR.
*/
#define	SENT_INTCLR19	(SENT_CH19_INTCLR)

/** \brief  5EC, Interrupt Enable Register */
#define SENT_CH19_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF00035ECu)

/** Alias (User Manual Name) for SENT_CH19_INTEN.
* To use register names with standard convension, please use SENT_CH19_INTEN.
*/
#define	SENT_INTEN19	(SENT_CH19_INTEN)

/** \brief  5E4, Interrupt Set Register */
#define SENT_CH19_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF00035E4u)

/** Alias (User Manual Name) for SENT_CH19_INTSET.
* To use register names with standard convension, please use SENT_CH19_INTSET.
*/
#define	SENT_INTSET19	(SENT_CH19_INTSET)

/** \brief  5E0, Interrupt Status Register */
#define SENT_CH19_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF00035E0u)

/** Alias (User Manual Name) for SENT_CH19_INTSTAT.
* To use register names with standard convension, please use SENT_CH19_INTSTAT.
*/
#define	SENT_INTSTAT19	(SENT_CH19_INTSTAT)

/** \brief  5D4, Input and Output Control Register */
#define SENT_CH19_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF00035D4u)

/** Alias (User Manual Name) for SENT_CH19_IOCR.
* To use register names with standard convension, please use SENT_CH19_IOCR.
*/
#define	SENT_IOCR19	(SENT_CH19_IOCR)

/** \brief  5C8, Receiver Control Register */
#define SENT_CH19_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF00035C8u)

