Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSent_reg.h
/** Alias (User Manual Name) for SENT_CH19_RCR.
* To use register names with standard convension, please use SENT_CH19_RCR.
*/
#define	SENT_RCR19	(SENT_CH19_RCR)

/** \brief  5CC, Receive Status Register */
#define SENT_CH19_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF00035CCu)

/** Alias (User Manual Name) for SENT_CH19_RSR.
* To use register names with standard convension, please use SENT_CH19_RSR.
*/
#define	SENT_RSR19	(SENT_CH19_RSR)

/** \brief  5D8, SPC Control Register */
#define SENT_CH19_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF00035D8u)

/** Alias (User Manual Name) for SENT_CH19_SCR.
* To use register names with standard convension, please use SENT_CH19_SCR.
*/
#define	SENT_SCR19	(SENT_CH19_SCR)

/** \brief  5D0, Serial Data and Status Register */
#define SENT_CH19_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF00035D0u)

/** Alias (User Manual Name) for SENT_CH19_SDS.
* To use register names with standard convension, please use SENT_CH19_SDS.
*/
#define	SENT_SDS19	(SENT_CH19_SDS)

/** \brief  5DC, Receive Data View Register */
#define SENT_CH19_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF00035DCu)

/** Alias (User Manual Name) for SENT_CH19_VIEW.
* To use register names with standard convension, please use SENT_CH19_VIEW.
*/
#define	SENT_VIEW19	(SENT_CH19_VIEW)

/** \brief  5F4, Watch Dog Timer Register */
#define SENT_CH19_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00035F4u)

/** Alias (User Manual Name) for SENT_CH19_WDT.
* To use register names with standard convension, please use SENT_CH19_WDT.
*/
#define	SENT_WDT19	(SENT_CH19_WDT)

/** \brief  144, Channel Fractional Divider Register */
#define SENT_CH1_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003144u)

/** Alias (User Manual Name) for SENT_CH1_CFDR.
* To use register names with standard convension, please use SENT_CH1_CFDR.
*/
#define	SENT_CFDR1	(SENT_CH1_CFDR)

/** \brief  140, Channel Pre Divider Register */
#define SENT_CH1_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003140u)

/** Alias (User Manual Name) for SENT_CH1_CPDR.
* To use register names with standard convension, please use SENT_CH1_CPDR.
*/
#define	SENT_CPDR1	(SENT_CH1_CPDR)

/** \brief  170, Interrupt Node Pointer Register */
#define SENT_CH1_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003170u)

/** Alias (User Manual Name) for SENT_CH1_INP.
* To use register names with standard convension, please use SENT_CH1_INP.
*/
#define	SENT_INP1	(SENT_CH1_INP)

/** \brief  168, Interrupt Clear Register */
#define SENT_CH1_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003168u)

/** Alias (User Manual Name) for SENT_CH1_INTCLR.
* To use register names with standard convension, please use SENT_CH1_INTCLR.
*/
#define	SENT_INTCLR1	(SENT_CH1_INTCLR)

/** \brief  16C, Interrupt Enable Register */
#define SENT_CH1_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000316Cu)

/** Alias (User Manual Name) for SENT_CH1_INTEN.
* To use register names with standard convension, please use SENT_CH1_INTEN.
*/
#define	SENT_INTEN1	(SENT_CH1_INTEN)

/** \brief  164, Interrupt Set Register */
#define SENT_CH1_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003164u)

/** Alias (User Manual Name) for SENT_CH1_INTSET.
* To use register names with standard convension, please use SENT_CH1_INTSET.
*/
#define	SENT_INTSET1	(SENT_CH1_INTSET)

/** \brief  160, Interrupt Status Register */
#define SENT_CH1_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003160u)

/** Alias (User Manual Name) for SENT_CH1_INTSTAT.
* To use register names with standard convension, please use SENT_CH1_INTSTAT.
*/
#define	SENT_INTSTAT1	(SENT_CH1_INTSTAT)

/** \brief  154, Input and Output Control Register */
#define SENT_CH1_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003154u)

/** Alias (User Manual Name) for SENT_CH1_IOCR.
* To use register names with standard convension, please use SENT_CH1_IOCR.
*/
#define	SENT_IOCR1	(SENT_CH1_IOCR)

/** \brief  148, Receiver Control Register */
#define SENT_CH1_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003148u)

/** Alias (User Manual Name) for SENT_CH1_RCR.
* To use register names with standard convension, please use SENT_CH1_RCR.
*/
#define	SENT_RCR1	(SENT_CH1_RCR)

/** \brief  14C, Receive Status Register */
#define SENT_CH1_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000314Cu)

/** Alias (User Manual Name) for SENT_CH1_RSR.
* To use register names with standard convension, please use SENT_CH1_RSR.
*/
#define	SENT_RSR1	(SENT_CH1_RSR)

/** \brief  158, SPC Control Register */
#define SENT_CH1_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003158u)

/** Alias (User Manual Name) for SENT_CH1_SCR.
* To use register names with standard convension, please use SENT_CH1_SCR.
*/
#define	SENT_SCR1	(SENT_CH1_SCR)

/** \brief  150, Serial Data and Status Register */
#define SENT_CH1_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003150u)

/** Alias (User Manual Name) for SENT_CH1_SDS.
* To use register names with standard convension, please use SENT_CH1_SDS.
*/
#define	SENT_SDS1	(SENT_CH1_SDS)

/** \brief  15C, Receive Data View Register */
#define SENT_CH1_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000315Cu)

/** Alias (User Manual Name) for SENT_CH1_VIEW.
* To use register names with standard convension, please use SENT_CH1_VIEW.
*/
#define	SENT_VIEW1	(SENT_CH1_VIEW)

/** \brief  174, Watch Dog Timer Register */
#define SENT_CH1_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003174u)

/** Alias (User Manual Name) for SENT_CH1_WDT.
* To use register names with standard convension, please use SENT_CH1_WDT.
*/
#define	SENT_WDT1	(SENT_CH1_WDT)

/** \brief  604, Channel Fractional Divider Register */
#define SENT_CH20_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003604u)

/** Alias (User Manual Name) for SENT_CH20_CFDR.
* To use register names with standard convension, please use SENT_CH20_CFDR.
*/
#define	SENT_CFDR20	(SENT_CH20_CFDR)

/** \brief  600, Channel Pre Divider Register */
#define SENT_CH20_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003600u)

/** Alias (User Manual Name) for SENT_CH20_CPDR.
* To use register names with standard convension, please use SENT_CH20_CPDR.
*/
#define	SENT_CPDR20	(SENT_CH20_CPDR)

/** \brief  630, Interrupt Node Pointer Register */
#define SENT_CH20_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003630u)

/** Alias (User Manual Name) for SENT_CH20_INP.
* To use register names with standard convension, please use SENT_CH20_INP.
*/
#define	SENT_INP20	(SENT_CH20_INP)

/** \brief  628, Interrupt Clear Register */
#define SENT_CH20_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003628u)

/** Alias (User Manual Name) for SENT_CH20_INTCLR.
* To use register names with standard convension, please use SENT_CH20_INTCLR.
*/
#define	SENT_INTCLR20	(SENT_CH20_INTCLR)

/** \brief  62C, Interrupt Enable Register */
#define SENT_CH20_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000362Cu)

