Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSent_reg.h
/** \brief  6D4, Input and Output Control Register */
#define SENT_CH23_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF00036D4u)

/** Alias (User Manual Name) for SENT_CH23_IOCR.
* To use register names with standard convension, please use SENT_CH23_IOCR.
*/
#define	SENT_IOCR23	(SENT_CH23_IOCR)

/** \brief  6C8, Receiver Control Register */
#define SENT_CH23_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF00036C8u)

/** Alias (User Manual Name) for SENT_CH23_RCR.
* To use register names with standard convension, please use SENT_CH23_RCR.
*/
#define	SENT_RCR23	(SENT_CH23_RCR)

/** \brief  6CC, Receive Status Register */
#define SENT_CH23_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF00036CCu)

/** Alias (User Manual Name) for SENT_CH23_RSR.
* To use register names with standard convension, please use SENT_CH23_RSR.
*/
#define	SENT_RSR23	(SENT_CH23_RSR)

/** \brief  6D8, SPC Control Register */
#define SENT_CH23_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF00036D8u)

/** Alias (User Manual Name) for SENT_CH23_SCR.
* To use register names with standard convension, please use SENT_CH23_SCR.
*/
#define	SENT_SCR23	(SENT_CH23_SCR)

/** \brief  6D0, Serial Data and Status Register */
#define SENT_CH23_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF00036D0u)

/** Alias (User Manual Name) for SENT_CH23_SDS.
* To use register names with standard convension, please use SENT_CH23_SDS.
*/
#define	SENT_SDS23	(SENT_CH23_SDS)

/** \brief  6DC, Receive Data View Register */
#define SENT_CH23_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF00036DCu)

/** Alias (User Manual Name) for SENT_CH23_VIEW.
* To use register names with standard convension, please use SENT_CH23_VIEW.
*/
#define	SENT_VIEW23	(SENT_CH23_VIEW)

/** \brief  6F4, Watch Dog Timer Register */
#define SENT_CH23_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00036F4u)

/** Alias (User Manual Name) for SENT_CH23_WDT.
* To use register names with standard convension, please use SENT_CH23_WDT.
*/
#define	SENT_WDT23	(SENT_CH23_WDT)

/** \brief  704, Channel Fractional Divider Register */
#define SENT_CH24_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003704u)

/** Alias (User Manual Name) for SENT_CH24_CFDR.
* To use register names with standard convension, please use SENT_CH24_CFDR.
*/
#define	SENT_CFDR24	(SENT_CH24_CFDR)

/** \brief  700, Channel Pre Divider Register */
#define SENT_CH24_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003700u)

/** Alias (User Manual Name) for SENT_CH24_CPDR.
* To use register names with standard convension, please use SENT_CH24_CPDR.
*/
#define	SENT_CPDR24	(SENT_CH24_CPDR)

/** \brief  730, Interrupt Node Pointer Register */
#define SENT_CH24_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003730u)

/** Alias (User Manual Name) for SENT_CH24_INP.
* To use register names with standard convension, please use SENT_CH24_INP.
*/
#define	SENT_INP24	(SENT_CH24_INP)

/** \brief  728, Interrupt Clear Register */
#define SENT_CH24_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003728u)

/** Alias (User Manual Name) for SENT_CH24_INTCLR.
* To use register names with standard convension, please use SENT_CH24_INTCLR.
*/
#define	SENT_INTCLR24	(SENT_CH24_INTCLR)

/** \brief  72C, Interrupt Enable Register */
#define SENT_CH24_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000372Cu)

/** Alias (User Manual Name) for SENT_CH24_INTEN.
* To use register names with standard convension, please use SENT_CH24_INTEN.
*/
#define	SENT_INTEN24	(SENT_CH24_INTEN)

/** \brief  724, Interrupt Set Register */
#define SENT_CH24_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003724u)

/** Alias (User Manual Name) for SENT_CH24_INTSET.
* To use register names with standard convension, please use SENT_CH24_INTSET.
*/
#define	SENT_INTSET24	(SENT_CH24_INTSET)

/** \brief  720, Interrupt Status Register */
#define SENT_CH24_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003720u)

/** Alias (User Manual Name) for SENT_CH24_INTSTAT.
* To use register names with standard convension, please use SENT_CH24_INTSTAT.
*/
#define	SENT_INTSTAT24	(SENT_CH24_INTSTAT)

/** \brief  714, Input and Output Control Register */
#define SENT_CH24_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003714u)

/** Alias (User Manual Name) for SENT_CH24_IOCR.
* To use register names with standard convension, please use SENT_CH24_IOCR.
*/
#define	SENT_IOCR24	(SENT_CH24_IOCR)

/** \brief  708, Receiver Control Register */
#define SENT_CH24_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003708u)

/** Alias (User Manual Name) for SENT_CH24_RCR.
* To use register names with standard convension, please use SENT_CH24_RCR.
*/
#define	SENT_RCR24	(SENT_CH24_RCR)

/** \brief  70C, Receive Status Register */
#define SENT_CH24_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000370Cu)

/** Alias (User Manual Name) for SENT_CH24_RSR.
* To use register names with standard convension, please use SENT_CH24_RSR.
*/
#define	SENT_RSR24	(SENT_CH24_RSR)

/** \brief  718, SPC Control Register */
#define SENT_CH24_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003718u)

/** Alias (User Manual Name) for SENT_CH24_SCR.
* To use register names with standard convension, please use SENT_CH24_SCR.
*/
#define	SENT_SCR24	(SENT_CH24_SCR)

/** \brief  710, Serial Data and Status Register */
#define SENT_CH24_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003710u)

/** Alias (User Manual Name) for SENT_CH24_SDS.
* To use register names with standard convension, please use SENT_CH24_SDS.
*/
#define	SENT_SDS24	(SENT_CH24_SDS)

/** \brief  71C, Receive Data View Register */
#define SENT_CH24_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000371Cu)

/** Alias (User Manual Name) for SENT_CH24_VIEW.
* To use register names with standard convension, please use SENT_CH24_VIEW.
*/
#define	SENT_VIEW24	(SENT_CH24_VIEW)

/** \brief  734, Watch Dog Timer Register */
#define SENT_CH24_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003734u)

/** Alias (User Manual Name) for SENT_CH24_WDT.
* To use register names with standard convension, please use SENT_CH24_WDT.
*/
#define	SENT_WDT24	(SENT_CH24_WDT)

