Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSent_reg.h
/** Alias (User Manual Name) for SENT_CH9_VIEW.
* To use register names with standard convension, please use SENT_CH9_VIEW.
*/
#define	SENT_VIEW9	(SENT_CH9_VIEW)

/** \brief  374, Watch Dog Timer Register */
#define SENT_CH9_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003374u)

/** Alias (User Manual Name) for SENT_CH9_WDT.
* To use register names with standard convension, please use SENT_CH9_WDT.
*/
#define	SENT_WDT9	(SENT_CH9_WDT)

/** \brief  0, Clock Control Register */
#define SENT_CLC /*lint --e(923)*/ (*(volatile Ifx_SENT_CLC*)0xF0003000u)

/** \brief  C, SENT Fractional Divider Register */
#define SENT_FDR /*lint --e(923)*/ (*(volatile Ifx_SENT_FDR*)0xF000300Cu)

/** \brief  8, Module Identification Register */
#define SENT_ID /*lint --e(923)*/ (*(volatile Ifx_SENT_ID*)0xF0003008u)

/** \brief  14, Interrupt Overview Register */
#define SENT_INTOV /*lint --e(923)*/ (*(volatile Ifx_SENT_INTOV*)0xF0003014u)

/** \brief  F4, Kernel Reset Register 0 */
#define SENT_KRST0 /*lint --e(923)*/ (*(volatile Ifx_SENT_KRST0*)0xF00030F4u)

/** \brief  F0, Kernel Reset Register 1 */
#define SENT_KRST1 /*lint --e(923)*/ (*(volatile Ifx_SENT_KRST1*)0xF00030F0u)

/** \brief  EC, Kernel Reset Status Clear Register */
#define SENT_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_KRSTCLR*)0xF00030ECu)

/** \brief  E8, OCDS Control and Status */
#define SENT_OCS /*lint --e(923)*/ (*(volatile Ifx_SENT_OCS*)0xF00030E8u)

/** \brief  80, Receive Data Register */
#define SENT_RDR0 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF0003080u)

/** \brief  84, Receive Data Register */
#define SENT_RDR1 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF0003084u)

/** \brief  A8, Receive Data Register */
#define SENT_RDR10 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030A8u)

/** \brief  AC, Receive Data Register */
#define SENT_RDR11 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030ACu)

/** \brief  B0, Receive Data Register */
#define SENT_RDR12 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030B0u)

/** \brief  B4, Receive Data Register */
#define SENT_RDR13 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030B4u)

/** \brief  B8, Receive Data Register */
#define SENT_RDR14 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030B8u)

/** \brief  BC, Receive Data Register */
#define SENT_RDR15 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030BCu)

/** \brief  C0, Receive Data Register */
#define SENT_RDR16 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030C0u)

/** \brief  C4, Receive Data Register */
#define SENT_RDR17 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030C4u)

/** \brief  C8, Receive Data Register */
#define SENT_RDR18 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030C8u)

/** \brief  CC, Receive Data Register */
#define SENT_RDR19 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030CCu)

/** \brief  88, Receive Data Register */
#define SENT_RDR2 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF0003088u)

/** \brief  D0, Receive Data Register */
#define SENT_RDR20 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030D0u)

/** \brief  D4, Receive Data Register */
#define SENT_RDR21 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030D4u)

/** \brief  D8, Receive Data Register */
#define SENT_RDR22 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030D8u)

/** \brief  DC, Receive Data Register */
#define SENT_RDR23 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030DCu)

/** \brief  E0, Receive Data Register */
#define SENT_RDR24 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030E0u)

/** \brief  8C, Receive Data Register */
#define SENT_RDR3 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF000308Cu)

/** \brief  90, Receive Data Register */
#define SENT_RDR4 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF0003090u)

/** \brief  94, Receive Data Register */
#define SENT_RDR5 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF0003094u)

/** \brief  98, Receive Data Register */
#define SENT_RDR6 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF0003098u)

/** \brief  9C, Receive Data Register */
#define SENT_RDR7 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF000309Cu)

/** \brief  A0, Receive Data Register */
#define SENT_RDR8 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030A0u)

/** \brief  A4, Receive Data Register */
#define SENT_RDR9 /*lint --e(923)*/ (*(volatile Ifx_SENT_RDR*)0xF00030A4u)

/** \brief  A80, Receive Time Stamp Register */
#define SENT_RTS0 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A80u)

/** \brief  A84, Receive Time Stamp Register */
#define SENT_RTS1 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A84u)

/** \brief  AA8, Receive Time Stamp Register */
#define SENT_RTS10 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AA8u)

/** \brief  AAC, Receive Time Stamp Register */
#define SENT_RTS11 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AACu)

/** \brief  AB0, Receive Time Stamp Register */
#define SENT_RTS12 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AB0u)

/** \brief  AB4, Receive Time Stamp Register */
#define SENT_RTS13 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AB4u)

/** \brief  AB8, Receive Time Stamp Register */
#define SENT_RTS14 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AB8u)

/** \brief  ABC, Receive Time Stamp Register */
#define SENT_RTS15 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003ABCu)

/** \brief  AC0, Receive Time Stamp Register */
#define SENT_RTS16 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AC0u)

/** \brief  AC4, Receive Time Stamp Register */
#define SENT_RTS17 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AC4u)

/** \brief  AC8, Receive Time Stamp Register */
#define SENT_RTS18 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AC8u)

/** \brief  ACC, Receive Time Stamp Register */
#define SENT_RTS19 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003ACCu)

/** \brief  A88, Receive Time Stamp Register */
#define SENT_RTS2 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A88u)

/** \brief  AD0, Receive Time Stamp Register */
#define SENT_RTS20 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AD0u)

/** \brief  AD4, Receive Time Stamp Register */
#define SENT_RTS21 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AD4u)

/** \brief  AD8, Receive Time Stamp Register */
#define SENT_RTS22 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AD8u)

/** \brief  ADC, Receive Time Stamp Register */
#define SENT_RTS23 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003ADCu)

/** \brief  AE0, Receive Time Stamp Register */
#define SENT_RTS24 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AE0u)

/** \brief  A8C, Receive Time Stamp Register */
#define SENT_RTS3 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A8Cu)

/** \brief  A90, Receive Time Stamp Register */
#define SENT_RTS4 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A90u)

/** \brief  A94, Receive Time Stamp Register */
#define SENT_RTS5 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A94u)

/** \brief  A98, Receive Time Stamp Register */
#define SENT_RTS6 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A98u)

/** \brief  A9C, Receive Time Stamp Register */
#define SENT_RTS7 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003A9Cu)

/** \brief  AA0, Receive Time Stamp Register */
#define SENT_RTS8 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AA0u)

/** \brief  AA4, Receive Time Stamp Register */
#define SENT_RTS9 /*lint --e(923)*/ (*(volatile Ifx_SENT_RTS*)0xF0003AA4u)

/** \brief  1C, Time Stamp Predivider Register */
#define SENT_TPD /*lint --e(923)*/ (*(volatile Ifx_SENT_TPD*)0xF000301Cu)

/** \brief  18, Module Time Stamp Register */
#define SENT_TSR /*lint --e(923)*/ (*(volatile Ifx_SENT_TSR*)0xF0003018u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSENT_REG_H */
